Revit 2027 API
ExternalService.IsSerializable Property
 Indicates whether executions of the service requires serialization in documents or not.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSerializable { get; }
Public ReadOnly Property IsSerializable As Boolean
	Get
public:
property bool IsSerializable {
	bool get ();
}
member IsSerializable : bool with get
Property Value
Boolean
Remarks
 When a serializable service is executed in a document, a record about the executed server (or servers) is stored in the document's history. This allows active servers to be synchronized next time a saved document is opened in Revit.
 Executions of a serializable service in a document must happen inside a transaction.
See Also
Reference
ExternalService Class
Autodesk.Revit.DB.ExternalService Namespace